tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "oven-sh/bun"

# Core tooling
brew "git"
brew "bash"
brew "tmux"
brew "neovim"

# Shell + prompt
brew "starship"
brew "lsd"
brew "fzf"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "zsh-completions"

# Search / pickers
brew "ripgrep"
brew "fd"

# Neovim formatter deps (conform.nvim)
brew "prettierd"
brew "stylua"

# Neovim (img-clip.nvim on macOS)
brew "pngpaste"

# JS/tooling
brew "node"
brew "pnpm"
brew "bun"

# Python tooling referenced by your Neovim config
brew "python"
brew "ruff"

# AI tooling
brew "opencode"

# Terminal + fonts
cask "ghostty"
cask "font-hack-nerd-font"

# Containers
cask "docker-desktop"

# Claude Code CLI
cask "claude-code"
